data = [
    {
        'id': 1,
        "category": "Номера",
        "subcategories": [
            {
                'id': 1,
                'subcategory': "Автомобильный номер | тип 1",
                'text': "Автомобильный номер «с отверстиями» и «без отверстий»",
                'price': 1000,
                'destiny': 'Предназначен для грузовых, легковых, грузопассажирских автомобилей и автобусов (кроме'
                           ' отнесенных к типу 1Б)',
                'size': '520 мм х112 мм',
                'colors': [],
                'sign_type': [],
                'images': [
                    {
                        'id': 1,
                        'image': 'http://127.0.0.1:8000/static/img/type1_1.jpg'
                    },
                    {
                        'id': 2,
                        'image': 'http://127.0.0.1:8000/static/img/type1_2.jpg'
                    },
                    {
                        'id': 3,
                        'image': 'http://127.0.0.1:8000/static/img/type1_1ot.jpg'
                    },
                    {
                        'id': 4,
                        'image': 'http://127.0.0.1:8000/static/img/type1_2ot.jpg'
                    }
                ]
            },
            {
                'id': 2,
                'subcategory': "Автомобильный номер | тип 1 (без флага)",
                'text': "Автомобильный номер «с отверстиями» и «без отверстий»",
                'price': 1500,
                'destiny': 'Предназначен для грузовых, легковых, грузопассажирских автомобилей и автобусов (кроме'
                           ' отнесенных к типу 1Б)',
                'size': '520 мм х112 мм',
                'colors': [],
                'sign_type': [],
                'images': [
                    {
                        'id': 5,
                        'image': 'http://127.0.0.1:8000/static/img/type1_w1.jpg'
                    },
                    {
                        'id': 6,
                        'image': 'http://127.0.0.1:8000/static/img/type1_w2.jpg'
                    },
                    {
                        'id': 7,
                        'image': 'http://127.0.0.1:8000/static/img/type1_w1ot.jpg'
                    },
                    {
                        'id': 8,
                        'image': 'http://127.0.0.1:8000/static/img/type1_w2ot.jpg'
                    }
                ]
            },
            {
                'id': 3,
                'subcategory': "Автомобильный номер | тип 1А",
                'text': "Предназначен для грузовых, легковых, грузопассажирских автомобилей и автобусов (кроме"
                        " отнесенных к типу 1Б)",
                'price': 1500,
                'destiny': 'Предназначен для грузовых, легковых, грузопассажирских автомобилей и автобусов (кроме'
                           ' отнесенных к типу 1Б)',
                'size': '290 мм х170 мм',
                'colors': [],
                'sign_type': [],
                'images': [
                    {
                        'id': 9,
                        'image': 'http://127.0.0.1:8000/static/img/type1a.jpg'
                    }
                ]
            },
            {
                'id': 4,
                'subcategory': "Автомобильный номер | тип 1Б, 5, 10, 20",
                'text': "Автомобильный номер для маршрутного такси, вооруженных сил, дипломатические номера, номер МВД",
                'price': 1800,
                'destiny': 'Автомобильный номер для маршрутного такси',
                'size': '520 мм × 112 мм',
                'colors': [
                    {'id': 1, 'name': 'желтый', 'color': '',
                     'image': 'http://127.0.0.1:8000/static/img/type1b_yellow.jpg'},
                    {'id': 2, 'name': 'черный', 'color': '',
                     'image': 'http://127.0.0.1:8000/static/img/type5_black.jpg'},
                    {'id': 3, 'name': 'красный', 'color': '',
                     'image': 'http://127.0.0.1:8000/static/img/type10_red.jpg'},
                    {'id': 4, 'name': 'синий', 'color': '',
                     'image': 'http://127.0.0.1:8000/static/img/type20_blue.jpg'},

                ],
                'sign_type': [],
                'images': [
                    {
                        'id': 10,
                        'image': 'http://127.0.0.1:8000/static/img/type1b1.jpg'
                    },
                    {
                        'id': 11,
                        'image': 'http://127.0.0.1:8000/static/img/type1b_yellow.jpg'
                    },
                    {
                        'id': 12,
                        'image': 'http://127.0.0.1:8000/static/img/type5_black.jpg'
                    },
                    {
                        'id': 13,
                        'image': 'http://127.0.0.1:8000/static/img/type10_red.jpg'
                    },
                    {
                        'id': 14,
                        'image': 'http://127.0.0.1:8000/static/img/type20_blue.jpg'
                    }
                ]
            },
            {
                'id': 5,
                'subcategory': "Автомобильный номер | тип 3",
                'text': "Номер для спецтехники, квадроцикла, трактора, телеги",
                'price': 1500,
                'destiny': 'Номер для спецтехники, квадроцикла, трактора, телеги',
                'size': '288 мм × 206 мм',
                'colors': [],
                'sign_type': [],
                'images': [
                    {
                        'id': 15,
                        'image': 'http://127.0.0.1:8000/static/img/type3.jpg'
                    }
                ]
            },
            {
                'id': 6,
                'subcategory': "Автомобильный номер | тип 4",
                'text': "Предназначен для мотоциклов",
                'price': 1500,
                'destiny': 'Предназначен для мотоциклов',
                'size': '190 мм х 145 мм',
                'colors': [],
                'sign_type': [],
                'images': [
                    {
                        'id': 16,
                        'image': 'http://127.0.0.1:8000/static/img/type4.jpg'
                    }
                ]
            },
        ]
    },
    {
        'id': 2,
        "category": "Рамки",
        "subcategories": [
            {
                'id': 7,
                'subcategory': "Силиконовая рамка RCS",
                'text': "Корпус рамки изготовлен из жёсткого силикона: он не изменяет своих свойств в сильный мороз и летнюю жару, не выцветает под солнцем и устойчив к действию агрессивных веществ.",
                'price': 1700,
                'destiny': [
                    'Минималистичный дизайн и аккуратные формы.',
                    'Корпус рамки изготовлен из жёсткого силикона: он не изменяет своих свойств в сильный мороз'
                    ' и летнюю жару, не выцветает под солнцем и устойчив к действию агрессивных веществ.',
                    ' Стальная основа и силиконовый корпус, в отличии от пластика или металла, не разрушаются и'
                    ' не деформируются.',
                    'Предлагаем вашему вниманию современные рамки для стильных машин! ',
                    'Рамка для номера RCS — это сочетание антивандальных и эстетических технологий, благодаря которым'
                    ' вы можете не волноваться за сохранность номера в любых условиях и подобрать нужный цвет'
                    ' рамки для оттенка вашего авто. На сегодняшний день они выпускаются в 6 вариантах цвета:'
                    ' черном, белом, сером, красном, синем и желтом, что позволяет вам по-новому взглянуть на,'
                    ' казалось бы, ничем не привлекательный аксессуар. ',

                    'Помимо оригинальных цветовых решений, производители продумали конструкцию и размеры. Минимальные размеры без рекламы придутся по'
                    ' вкусу многим, кто не хочет ездить с названием автосалона. Рамка для номера RCS плотно'
                    ' прилегает к бамперу и представляет собой конструкцию из стальной основы и силиконового'
                    ' корпуса. Силикон устойчив к перепадам температур, влажности, осадкам, что позволяет рамкам'
                    ' не терять внешний вид и прочность фиксации номера. Сталь с антикоррозийным покрытием'
                    ' защищена от воздействия воды и влажности. Силикон используется для надежной фиксации'
                    ' госномера, так как устойчив к механическим воздействиям.',
                ],

                'size': '',
                'colors': [
                    {'id': 5, 'name': 'черный', 'color': '#000000', 'image': ''},
                    {'id': 6, 'name': 'белый', 'color': '#fffff', 'image': ''},
                    {'id': 7, 'name': 'синий', 'color': '#0000FF', 'image': ''},
                    {'id': 8, 'name': 'красный', 'color': '#FF0000', 'image': ''},
                    {'id': 9, 'name': 'желтый', 'color': '#FFFF00', 'image': ''},
                ],
                'sign_type': [],
                'images': [
                    {
                        'id': 17,
                        'image': 'http://127.0.0.1:8000/static/img/frames.png'
                    }
                ]
            },
        ]
    },
    {
        'id': 3,
        "category": "Аксессуары",
        "subcategories": []
    },
    {
        'id': 4,
        "category": "Знаки",
        "subcategories": [
            {
                'id': 8,
                'subcategory': "Знаки опасности допог",
                'text': 'Корпус рамки изготовлен из жёсткого силикона: он не изменяет своих свойств в сильный мороз и'
                        ' летнюю жару, не выцветает под солнцем и устойчив к действию агрессивных веществ.',
                'price': 1500,
                'destiny': ['Минималистичный дизайн и аккуратные формы.',
                            ' Корпус рамки изготовлен из жёсткого силикона: он не изменяет своих свойств в сильный '
                            'мороз и летнюю жару, не выцветает под солнцем и  устойчив к действию агрессивных веществ.',
                            ' Стальная основа и силиконовый корпус, в отличии от пластика или металла, не разрушаются '
                            'и не деформируются.'],
                'size': '20×20 см',
                'colors': [],
                'sign_type': [
                    {
                        'id': 1,
                        'image': 'http://127.0.0.1:8000/static/img/signs_danger1.jpg',
                        'alt': 'Огнеопасно'
                    }
                ],
                'images': [
                    {
                        'id': 18,
                        'image': 'http://127.0.0.1:8000/static/img/signs_danger2.jpg'
                    },
                    {
                        'id': 19,
                        'image': 'http://127.0.0.1:8000/static/img/signs_danger1.jpg'
                    }
                ]
            },
            {
                'id': 9,
                'subcategory': "Знаки ДОПОГ",
                'text': 'Табличка с надписью — применяется для маркировки автомобилей, перевозящих опасные грузы, для'
                        ' которых указан №ООН и КЭМ; табличка без надписей — применяется для маркировки автомобилей,'
                        ' перевозящих опасные грузы независимо от способа их перевозки',
                'price': 1500,
                'text2': 'Оранжевая металлическая светоотражающая табличка',
                'destiny': 'Используется для обозначения перевозимого опасного груза. На автомобиле должно быть'
                           ' установлено две таблички: одна спереди, вторая сзади. Для удобства установки и снятия'
                           ' табличек можно купить специальный держатель.',
                'size': '400х300мм',
                'colors': [],
                'sign_type': [],
                'images': [
                    {
                        'id': 20,
                        'image': 'http://127.0.0.1:8000/static/img/sings_dopog.png'
                    },
                ]
            },
        ]
    },
    {
        'id': 5,
        "category": "Болты",
        "subcategories": [
            {
                'id': 10,
                'subcategory': "Болты",
            }
        ]
    },
]
